Abhi0803/stm32f407xx_drivers/Src/003_GPIO_External_BTN_LED.c
/*
 * 001LED_Toggle.c
 *
 *  Created on: Sep 25, 2020
 *      Author: jhaab
 */
#include "stm32f407xx.h"



void GPIO_LED_Init(uint8_t GPIO_PIN){
	GPIO_HANDLE_t GPIOLED;
	GPIOLED.pGPIOx = GPIOD;
	GPIOLED.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN;
	GPIOLED.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GPIOLED.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIOLED.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GPIOLED.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_PClkCtrl(GPIOD, ENABLE);

	GPIO_Init(&GPIOLED);


}
void GPIO_BTN_Init(uint8_t GPIO_PIN){
	GPIO_HANDLE_t GPIOBTN;
	GPIOBTN.pGPIOx = GPIOB;
	GPIOBTN.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN;
	GPIOBTN.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIOBTN.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIOBTN.GPIO_PinConfig.GPIO_PinPuPdControl = GPIO_PIN_PD;

	GPIO_PClkCtrl(GPIOB, ENABLE);

	GPIO_Init(&GPIOBTN);


}
int main(){

	GPIO_LED_Init(GPIO_PIN_12);
	GPIO_LED_Init(GPIO_PIN_13);
	GPIO_LED_Init(GPIO_PIN_14);
	GPIO_LED_Init(GPIO_PIN_15);
	GPIO_BTN_Init(GPIO_PIN_12);
	while(1){

		if(GPIO_ReadPin(GPIOB,  GPIO_PIN_12)){
			Delay(250);
			GPIO_ToggleLEDPin(GPIOD, LED_PIN_12|LED_PIN_13);
		}


	}
	return 0;
}
